; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-4-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-2 - location
	p0-5 - location
	p0-6 - location
	p1-2 - location
	p2-0 - location
	p2-3 - location
	p3-1 - location
	p3-7 - location
	p3-8 - location
	p4-1 - location
	p5-1 - location
	p5-8 - location
	p6-2 - location
	p6-3 - location
	p6-4 - location
	p6-9 - location
	p7-4 - location
	p8-1 - location
	p9-4 - location
	)
	(:init
	(at driver1 s6)
	(at driver2 s1)
	(at driver3 s3)
	(at driver4 s5)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s9)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s2)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s9)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s8)
	(at package2 s1)
	(at package3 s7)
	(at package4 s3)
	(at package5 s0)
	(at package6 s2)
	(at package7 s1)
	(at package8 s9)
	(at package9 s6)
	(at package10 s6)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s3 p3-8)
	(path p3-8 s3)
	(path s8 p3-8)
	(path p3-8 s8)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(path s6 p6-9)
	(path p6-9 s6)
	(path s9 p6-9)
	(path p6-9 s9)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(path s9 p9-4)
	(path p9-4 s9)
	(path s4 p9-4)
	(path p9-4 s4)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 9)
	(= (time-to-drive s9 s0) 9)
	(link s1 s9)
	(link s9 s1)
	(= (time-to-drive s1 s9) 69)
	(= (time-to-drive s9 s1) 69)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 19)
	(= (time-to-drive s5 s2) 19)
	(link s2 s9)
	(link s9 s2)
	(= (time-to-drive s2 s9) 54)
	(= (time-to-drive s9 s2) 54)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 77)
	(= (time-to-drive s0 s3) 77)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 89)
	(= (time-to-drive s4 s3) 89)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 29)
	(= (time-to-drive s6 s3) 29)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 93)
	(= (time-to-drive s7 s3) 93)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 60)
	(= (time-to-drive s0 s4) 60)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 74)
	(= (time-to-drive s1 s4) 74)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 97)
	(= (time-to-drive s7 s4) 97)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 55)
	(= (time-to-drive s8 s4) 55)
	(link s4 s9)
	(link s9 s4)
	(= (time-to-drive s4 s9) 48)
	(= (time-to-drive s9 s4) 48)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 8)
	(= (time-to-drive s1 s5) 8)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 65)
	(= (time-to-drive s4 s5) 65)
	(link s5 s9)
	(link s9 s5)
	(= (time-to-drive s5 s9) 65)
	(= (time-to-drive s9 s5) 65)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 100)
	(= (time-to-drive s1 s6) 100)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 73)
	(= (time-to-drive s2 s6) 73)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 22)
	(= (time-to-drive s4 s6) 22)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 63)
	(= (time-to-drive s5 s6) 63)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 47)
	(= (time-to-drive s8 s6) 47)
	(link s6 s9)
	(link s9 s6)
	(= (time-to-drive s6 s9) 47)
	(= (time-to-drive s9 s6) 47)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 52)
	(= (time-to-drive s1 s7) 52)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 82)
	(= (time-to-drive s5 s7) 82)
	(link s8 s1)
	(link s1 s8)
	(= (time-to-drive s8 s1) 31)
	(= (time-to-drive s1 s8) 31)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 60)
	(= (time-to-drive s2 s8) 60)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 77)
	(= (time-to-drive s3 s9) 77)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s7)
	(at driver2 s7)
	(at driver4 s1)
	(at truck1 s7)
	(at truck2 s8)
	(at truck3 s5)
	(at truck4 s9)
	(at package1 s5)
	(at package2 s5)
	(at package3 s1)
	(at package4 s3)
	(at package5 s7)
	(at package6 s2)
	(at package7 s4)
	(at package8 s3)
	(at package9 s6)
	(at package10 s5)
	))

(:metric minimize (+ (* 3 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver2 truck1 s1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 4 of 17
2. (load-truck package7 truck1 s1)
   deleted: (at package7 s1)
   added: (in package7 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 4 of 17
3. (walk driver3 s3 p2-3)
   deleted: (at driver3 s3)
   added: (at driver3 p2-3)
   goals met: 4 of 17
4. (walk driver3 p2-3 s2)
   deleted: (at driver3 p2-3)
   added: (at driver3 s2)
   goals met: 4 of 17
5. (load-truck package2 truck1 s1)
   deleted: (at package2 s1)
   added: (in package2 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 4 of 17
6. (drive-truck truck1 s1 s9 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s9)
   changed: (fuel-used) from 0 to 897
   goals met: 4 of 17
7. (walk driver4 s5 p5-1)
   deleted: (at driver4 s5)
   added: (at driver4 p5-1)
   goals met: 4 of 17
8. (walk driver1 s6 p6-9)
   deleted: (at driver1 s6)
   added: (at driver1 p6-9)
   goals met: 4 of 17
9. (walk driver4 p5-1 s1)
   deleted: (at driver4 p5-1)
   added: (at driver4 s1)
   goals met: 5 of 17
10. (load-truck package8 truck1 s9)
   deleted: (at package8 s9)
   added: (in package8 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 5 of 17
11. (drive-truck truck1 s9 s4 driver2)
   deleted: (at truck1 s9)
   added: (at truck1 s4)
   changed: (fuel-used) from 897 to 1665
   goals met: 5 of 17
12. (walk driver1 p6-9 s9)
   deleted: (at driver1 p6-9)
   added: (at driver1 s9)
   goals met: 5 of 17
13. (unload-truck package7 truck1 s4)
   deleted: (in package7 truck1)
   added: (at package7 s4)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 6 of 17
14. (board-truck driver3 truck3 s2)
   deleted: (at driver3 s2) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 6 of 17
15. (drive-truck truck3 s2 s5 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   changed: (fuel-used) from 1665 to 1855
   goals met: 7 of 17
16. (drive-truck truck1 s4 s3 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   changed: (fuel-used) from 1855 to 3012
   goals met: 7 of 17
17. (unload-truck package8 truck1 s3)
   deleted: (in package8 truck1)
   added: (at package8 s3)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 8 of 17
18. (drive-truck truck1 s3 s4 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (fuel-used) from 3012 to 3991
   goals met: 8 of 17
19. (drive-truck truck3 s5 s6 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   changed: (fuel-used) from 3991 to 4621
   goals met: 7 of 17
20. (load-truck package10 truck3 s6)
   deleted: (at package10 s6)
   added: (in package10 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 7 of 17
21. (drive-truck truck3 s6 s5 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   changed: (fuel-used) from 4621 to 5314
   goals met: 8 of 17
22. (unload-truck package10 truck3 s5)
   deleted: (in package10 truck3)
   added: (at package10 s5)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 9 of 17
23. (drive-truck truck1 s4 s7 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   changed: (fuel-used) from 5314 to 6381
   goals met: 10 of 17
24. (board-truck driver1 truck2 s9)
   deleted: (at driver1 s9) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 10 of 17
25. (drive-truck truck2 s9 s0 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s0)
   changed: (fuel-used) from 6381 to 6471
   goals met: 10 of 17
26. (drive-truck truck2 s0 s4 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   changed: (fuel-used) from 6471 to 7071
   goals met: 10 of 17
27. (load-truck package3 truck1 s7)
   deleted: (at package3 s7)
   added: (in package3 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 10 of 17
28. (drive-truck truck1 s7 s5 driver2)
   deleted: (at truck1 s7)
   added: (at truck1 s5)
   changed: (fuel-used) from 7071 to 8137
   goals met: 9 of 17
29. (unload-truck package2 truck1 s5)
   deleted: (in package2 truck1)
   added: (at package2 s5)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 10 of 17
30. (drive-truck truck1 s5 s7 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s7)
   changed: (fuel-used) from 8137 to 9039
   goals met: 11 of 17
31. (drive-truck truck2 s4 s0 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   changed: (fuel-used) from 9039 to 9639
   goals met: 11 of 17
32. (load-truck package5 truck2 s0)
   deleted: (at package5 s0)
   added: (in package5 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 11 of 17
33. (drive-truck truck2 s0 s4 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   changed: (fuel-used) from 9639 to 10299
   goals met: 11 of 17
34. (drive-truck truck2 s4 s7 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s7)
   changed: (fuel-used) from 10299 to 11366
   goals met: 11 of 17
35. (unload-truck package5 truck2 s7)
   deleted: (in package5 truck2)
   added: (at package5 s7)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 12 of 17
36. (drive-truck truck1 s7 s1 driver2)
   deleted: (at truck1 s7)
   added: (at truck1 s1)
   changed: (fuel-used) from 11366 to 11938
   goals met: 11 of 17
37. (unload-truck package3 truck1 s1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 12 of 17
38. (drive-truck truck1 s1 s7 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s7)
   changed: (fuel-used) from 11938 to 12458
   goals met: 13 of 17
39. (disembark-truck driver2 truck1 s7)
   deleted: (driving driver2 truck1)
   added: (at driver2 s7) (empty truck1)
   goals met: 14 of 17
40. (disembark-truck driver1 truck2 s7)
   deleted: (driving driver1 truck2)
   added: (at driver1 s7) (empty truck2)
   goals met: 15 of 17
41. (board-truck driver2 truck2 s7)
   deleted: (at driver2 s7) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 14 of 17
42. (drive-truck truck3 s5 s4 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (fuel-used) from 12458 to 13108
   goals met: 13 of 17
43. (drive-truck truck3 s4 s8 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s8)
   changed: (fuel-used) from 13108 to 13658
   goals met: 13 of 17
44. (load-truck package1 truck3 s8)
   deleted: (at package1 s8)
   added: (in package1 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 13 of 17
45. (drive-truck truck3 s8 s1 driver3)
   deleted: (at truck3 s8)
   added: (at truck3 s1)
   changed: (fuel-used) from 13658 to 13999
   goals met: 13 of 17
46. (disembark-truck driver2 truck2 s7)
   deleted: (driving driver2 truck2)
   added: (at driver2 s7) (empty truck2)
   goals met: 14 of 17
47. (board-truck driver1 truck2 s7)
   deleted: (at driver1 s7) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 13 of 17
48. (drive-truck truck2 s7 s4 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s4)
   changed: (fuel-used) from 13999 to 14969
   goals met: 13 of 17
49. (drive-truck truck2 s4 s8 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s8)
   changed: (fuel-used) from 14969 to 15519
   goals met: 14 of 17
50. (disembark-truck driver1 truck2 s8)
   deleted: (driving driver1 truck2)
   added: (at driver1 s8) (empty truck2)
   goals met: 14 of 17
51. (drive-truck truck3 s1 s7 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s7)
   changed: (fuel-used) from 15519 to 16091
   goals met: 14 of 17
52. (walk driver1 s8 p3-8)
   deleted: (at driver1 s8)
   added: (at driver1 p3-8)
   goals met: 14 of 17
53. (drive-truck truck3 s7 s5 driver3)
   deleted: (at truck3 s7)
   added: (at truck3 s5)
   changed: (fuel-used) from 16091 to 16993
   goals met: 15 of 17
54. (unload-truck package1 truck3 s5)
   deleted: (in package1 truck3)
   added: (at package1 s5)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 16 of 17
55. (walk driver1 p3-8 s3)
   deleted: (at driver1 p3-8)
   added: (at driver1 s3)
   goals met: 16 of 17
56. (walk driver1 s3 p3-7)
   deleted: (at driver1 s3)
   added: (at driver1 p3-7)
   goals met: 16 of 17
57. (walk driver1 p3-7 s7)
   deleted: (at driver1 p3-7)
   added: (at driver1 s7)
   goals met: 17 of 17
